package moe.akagi.chibaproject.database;

/**
 * Created by yunze on 12/4/15.
 */
public class Data {
    public static String[][] person = {
            {"13319280475", "password", "李明"},
            {"13920495095", "q1w2e3r4", "刘星"},
            {"18868129354", "123456",   "Lisa"},
            {"13571889284", "passwd",   "Paul"}
    };

    public static String[][] event = {
            {"1", "这是Title", "1449244665000", "1", "紫金港",    "0"},
            {"1", "淀粉盛宴", "1449244675000", "1", "紫金港",    "0"},
            {"2", "拌面拌面", "1449244765000", "1", "玉泉靓园",  "2"},
            {"3", "我要吃鸡", "1449293468000", "0", "北门烧烤",  "1"}
    };

    public static String[][] friend = {
            {"1", "2"},
            {"1", "3"},
            {"1", "4"},
            {"2", "4"},
            {"3", "4"}
    };

    public static String[][] part_in = {
            {"1", "1"},
            {"1", "2"},
            {"2", "1"},
            {"2", "2"},
            {"2", "3"},
            {"2", "4"},
            {"3", "2"},
            {"3", "3"},
            {"4", "3"},
            {"4", "2"},
            {"4", "1"},
            {"4", "4"}
    };

    public static String[][] launch = {
            {"1", "1"},
            {"1", "2"},
            {"2", "3"},
            {"3", "4"}
    };

    public static String[][] decision = {
            {"1", "1", "0", "1450076272053", "0", "0"},
            {"1", "2", "2", "堕落街", "1", "0"},
            {"1", "2", "1", "1450076272053", "1", "0"}
    };

    public static String[][] vote = {
            {"2", "1", "1"},
            {"3", "1", "1"}
    };
}
