package moe.akagi.chibaproject.database;

/**
 * Created by yunze on 12/4/15.
 */
public class Data {
    public static String[][] person = {
            {"13319280475", "password", "Chiba"},
            {"13920495095", "q1w2e3r4", "John"},
            {"18868129354", "123456",   "Lisa"},
            {"13571889284", "passwd",   "Paul"}
    };

    public static String[][] event = {
            {"1", "吃土少年只能约得起食堂", "1449244665000", "1", "靓园食堂",  "0"},
            {"1", "谢绝不吃辣", "1449244675000", "1", "火狐狸(玉古店)",    "0"},
            {"2", "沙县国际大酒店", "1449244765000", "1", "青芝坞沙县小吃",  "2"},
            {"3", "肉!", "1449293468000", "0", "春暖花开",  "1"}
    };

    public static String[][] friend = {
            {"1", "2"},
            {"1", "3"},
            {"1", "4"},
            {"2", "4"},
            {"3", "4"}
    };

    public static String[][] part_in = {
            {"1", "1"},
            {"1", "2"},
            {"2", "1"},
            {"2", "2"},
            {"2", "3"},
            {"2", "4"},
            {"3", "2"},
            {"3", "3"},
            {"4", "3"},
            {"4", "2"},
            {"4", "1"},
            {"4", "4"}
    };

    public static String[][] launch = {
            {"1", "1"},
            {"1", "2"},
            {"2", "3"},
            {"3", "4"}
    };

    public static String[][] decision = {
            {"1", "1", "0", "1450076272053"},
            {"1", "2", "2", "清真食堂"},
            {"1", "2", "1", "1450076272053"}
    };

    public static String[][] vote = {
            {"2", "1", "1"},
            {"3", "1", "1"}
    };
}
