package moe.akagi.chibaproject.database;

/**
 * Created by yunze on 12/4/15.
 */
public class Data {
    public static String[][] person = {
            {"13319280475", "password", "李明"},
            {"13920495095", "q1w2e3r4", "刘星"},
            {"18868129354", "123456",   "Lisa"},
            {"13571889284", "passwd",   "Paul"}
    };

    public static String[][] event = {
            {"1", "1449244665000", "紫金港",    "0"},
            {"1", "1449244675000", "紫金港",    "0"},
            {"2", "1449244765000", "玉泉靓园",  "2"},
            {"3", "1449293468000", "北门烧烤",  "1"}
    };

    public static String[][] friend = {
            {"1", "2"},
            {"1", "3"},
            {"1", "4"},
            {"2", "4"},
            {"3", "4"}
    };

    public static String[][] part_in = {
            {"1", "1"},
            {"1", "2"},
            {"2", "1"},
            {"2", "2"},
            {"2", "3"},
            {"2", "4"},
            {"3", "2"},
            {"3", "3"},
            {"4", "3"},
            {"4", "2"},
            {"4", "1"},
            {"4", "4"}
    };

    public static String[][] launch = {
            {"1", "1"},
            {"1", "2"},
            {"2", "3"},
            {"3", "4"}
    };
}
